# Intro to SQL -- 

## Running SQL in Jupyter Notebooks (all steps, more detail than you will see on homeworks and exams)

In [5]:
# !wget https://github.com/gt-cse-6040/bootcamp/raw/main/Module%201/Session%204/example.db

### Running SQL from Jupyter notebooks.

In general, there are three steps to running SQL queries, and a fourth step, specific to this class:

1. Create a database connection. In this class, we will not ask you to create database connections for a grade. We will provide the database connections, and in most cases we will also provide queries that give you an initial view of the tables in the database.


2. Write the query. **Homework NBs and Exams will ask you to put the query into a string variable**, and then the test cell will use the variable name in the query execution step.


3. Execute the query and return the results. You will always return the results into a pandas dataframe, and the test case variables will be comparing your pandas dataframe output to the solution/true pandas dataframe output. This class will typically use the pandas function **read_sql_query()** for this step.


4. For this class, because you will always return your query results to a pandas dataframe, you can use the function **assert_frame_equal()** to test and troubleshoot your query results. More on this in subsequent notebooks.

In [6]:
import pandas as pd

In [7]:
# create a connection to the database
import sqlite3 as db

# This is the example database, from Part 0 of NB 9.
# Connect to a database (or create one if it doesn't exist)
conn = db.connect('example.db')

We recommend using the three single quotes paradigm for strings in Python, allowing you to include any characters you need within the query, and not having to worry about escape characters.

We also recommend starting with some form of query template, as below.

Such a template separates (and organizes) the various clauses, allowing you to visually see and understand what you are doing.

In [8]:
# showing query template
# note the we are putting the query string into the variable 'query'.

query = '''
SELECT

FROM

WHERE

GROUP BY

HAVING

ORDER BY

LIMIT

'''

In [9]:
# example query
query1 = '''

SELECT *

FROM Students

LIMIT 5

'''

In [10]:
result = pd.read_sql_query(query1, conn)
result

   gtid   name
0   123  Vuduc
1   456   Chau
2   381  Bader
3   991  Sokol
4   723  Rozga

In [12]:
# another query
# note the indentations and single line item paradigm
query2 = '''

SELECT Students.name,
       Takes.grade

FROM Students, Takes

WHERE Students.gtid = Takes.gtid
      AND Takes.course = 'CSE 6040'

'''

In [13]:
# execute the query
result2 = pd.read_sql_query(query2, conn)
result2

    name  grade
0  Vuduc    4.0
1  Sokol    4.0
2   Chau    4.0

### Both of these queries return a pandas dataframe, and this is the methodology, albeit in two VERY SIMPLE examples, that you will see throughout the course.

### Our next notebooks will expand on this methodology, and how students will operate in the course.

### DB Browser for SQLite

#### SQLite has a database IDE tool, DB Browser, which allows you to connect to the database and write queries directly.

While you may or may not find it useful in this class, it is a very good tool to use in other classes in this program. Most classes (with the exception of CSE 6242 -- DVA) that utilize databases use SQLite, so having this "tool in your toolbox" will be valuable to you in those classes.

You will not be able to easily use DB Browser in this class, as the databases are stored on Vocareum and are not accessible to students outside of Vocareum. There are ways to download the databases and work with them, but we don't encourage or support them, so if you want to try, you are on your own. Please don't ask for help with doing this on Piazza, as the TAs will not be able to assist.

You can download DB Browser from the following link: https://sqlitebrowser.org/